#Область ПрограммныйИнтерфейс
// Процедура по добавлению Контактных лиц на форму програмно
Процедура РаботаСФормамиДобавитьКонтактноеЛицо(Форма)Экспорт
		
	// Начало доработки Савельева 17.08.2026 выводить контактных лиц 
	ИмяФормы = Форма.ИмяФормы;
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента"
		ИЛИ ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента"
		ИЛИ ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		
		Родитель = Форма.Элементы.Найти("ГруппаШапкаПраво");
		ЭлементКонтактноеЛицо = Форма.Элементы.Добавить("ПолеКонтактноеЛицо", Тип("ПолеФормы"),Родитель);
		       //Форма.Элементы.ГруппаШапкаПраво
		ЭлементКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементКонтактноеЛицо.ПутьКДанным = "Объект.КонтактноеЛицо";
		ЭлементКонтактноеЛицо.Заголовок = "Контактное лицо";
		
		// Отбор: показывать только контактные лица текущего контрагента
		МассивСвязей = Новый Массив;
		
		НоваяСвязь = Новый СвязьПараметраВыбора( "Отбор.Владелец", "Объект.Контрагент");      
		// имя параметра отбора в форме выбора справочника
		// путь к реквизиту документа, по которому фильтруем
		
		МассивСвязей.Добавить(НоваяСвязь);
		
		// Преобразуем в ФиксированныйМассив и присваиваем элементу формы
		ЭлементКонтактноеЛицо.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей); 
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента"
		ИЛИ ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		
		Родитель1 = Форма.Элементы.Основание;
		
		ЭлементКонтактноеЛицо = Форма.Элементы.Вставить("ПолеКонтактноеЛицо", Тип("ПолеФормы"),,Родитель1);
		
		ЭлементКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементКонтактноеЛицо.ПутьКДанным = "Объект.КонтактноеЛицо";
		ЭлементКонтактноеЛицо.Заголовок = "Контактное лицо";
		
		// Отбор: показывать только контактные лица текущего контрагента
		МассивСвязей = Новый Массив;
		
		НоваяСвязь = Новый СвязьПараметраВыбора( "Отбор.Владелец", "Объект.Контрагент");      
		// имя параметра отбора в форме выбора справочника
		// путь к реквизиту документа, по которому фильтруем
		
		МассивСвязей.Добавить(НоваяСвязь);
		
		// Преобразуем в ФиксированныйМассив и присваиваем элементу формы
		ЭлементКонтактноеЛицо.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей); 
		
	КонецЕсли;
	// Савельева 17.08.2026 Конец Доработки

КонецПроцедуры

#КонецОбласти